import { v4 as uuid } from 'uuid';

type Includent = {
  id: string;
  title: string;
  description: string;
  price?: number;
};

type Item = {
  id: string;
  name: string;
  price?: number;
  displayName: string;
  includes?: Includent[];
};

type Os = {
  id: string;
  name: string;
  displayName: string;
  items: Item[];
};

type Menus = {
  id: string;
  title: string;
  os: Os[];
};

export const menus: Menus[] = [
  {
    id: uuid(),
    title: 'Годовые Пакеты',
    os: [
      {
        id: uuid(),
        name: 'android',
        displayName: 'Android',
        items: [
          {
            id: uuid(),
            name: 'silverCardAndroid',
            displayName: 'Sivler Card',
            price: 800,
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи Google',
                description:
                  'Активация синхронизации с Google. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого телефона. Перенос осуществляется с ОДНОГО старого телефона.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'Настройка офисных программ',
                description:
                  'Установка Docs, Sheets, Presentation, Adobe Acrobat. Все "вордовские", "екселевские" и т.д. файы будет открываться автоматически в нужной программе. Без них даже обычный "вордовский" документ не откроется.',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
              {
                id: uuid(),
                title: 'Родительский контроль',
                description: 'Лицензия Kroha 12мес.',
              },
              {
                id: uuid(),
                title: 'IPTV',
                description: 'Подписка на SweetTV 3мес',
              },
            ],
          },
          {
            id: uuid(),
            name: 'goldCardAndroid',
            displayName: 'Gold Card',
            price: 1500,
            includes: [
              {
                id: uuid(),
                title: 'Подбор лучших приложений',
                description:
                  'Клиент называет функцию, например "хочу редактирофать фотки" - тех ставит 3-4 топовых фоторедактора.',
              },
              {
                id: uuid(),
                title: 'Електронная коммерция',
                description:
                  'Настройка GooglePay, банкингов и других платежных систем',
              },
              {
                id: uuid(),
                title: 'Оптимизация ОС',
                description:
                  'Настройка энергопотребления, отключение ненужных фоновых процессов, настройка автоочистки кэша, настройка потребления трафика и т.д.',
              },
              {
                id: uuid(),
                title: 'Облачные сервисы',
                description:
                  'Настройка доступа к облаку для загрузки/выгрузки файлов НЕ ВКЛЮЧЕТ В СЕБЯ синхронизацию с тругими устройствами и резервное копирование',
              },
              {
                id: uuid(),
                title: 'Антивирус',
                description:
                  'Лицензионный антивирус Avast Mobile Security 12мес',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 1мес',
              },
            ],
          },
          {
            id: uuid(),
            name: 'platinumCardAndroid',
            displayName: 'Platinum Card',
            price: 2000,
            includes: [
              {
                id: uuid(),
                title: 'Настройка медиа-сервисов',
                description:
                  'Настраиваем подписки на сервисы AppleMusic, Spotify, Netflix, YouTube т.д.',
              },
              {
                id: uuid(),
                title: 'Синхронизация всех устройств',
                description:
                  'Данные клиента всегда будут доступны на любом из его устройств',
              },
              {
                id: uuid(),
                title: 'Резервное копирование',
                description:
                  'Автоматические резервные копии данных в облако, для сохранности в случае утери, или поломки телефона',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 3мес',
              },
            ],
          },
        ],
      },
      {
        id: uuid(),
        name: 'ios',
        displayName: 'iOS',
        items: [
          {
            id: uuid(),
            name: 'silverCardiOS',
            displayName: 'Sivler Card',
            price: 800,
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи AppleId',
                description:
                  'Активация синхронизации с iCloud. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого телефона. Перенос осуществляется с ОДНОГО старого телефона.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'Настройка офисных программ',
                description:
                  'Установка Docs, Sheets, Presentation, Adobe Acrobat. Все "вордовские", "екселевские" и т.д. файы будет открываться автоматически в нужной программе. Без них даже обычный "вордовский" документ не откроется.',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
            ],
          },
          {
            id: uuid(),
            name: 'goldCardiOS',
            displayName: 'Gold Card',
            price: 1500,
            includes: [
              {
                id: uuid(),
                title: 'Подбор лучших приложений',
                description:
                  'Клиент называет функцию, например "хочу редактирофать фотки" - тех ставит 3-4 топовых фоторедактора.',
              },
              {
                id: uuid(),
                title: 'Електронная коммерция',
                description:
                  'Настройка GooglePay, банкингов и других платежных систем',
              },
              {
                id: uuid(),
                title: 'Оптимизация ОС',
                description:
                  'Настройка энергопотребления, отключение ненужных фоновых процессов, настройка автоочистки кэша, настройка потребления трафика и т.д.',
              },
              {
                id: uuid(),
                title: 'Облачные сервисы',
                description:
                  'Настройка доступа к облаку для загрузки/выгрузки файлов НЕ ВКЛЮЧЕТ В СЕБЯ синхронизацию с тругими устройствами и резервное копирование',
              },
              {
                id: uuid(),
                title: 'Антивирус',
                description:
                  'Лицензионный антивирус Avast Mobile Security 12мес',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 1мес',
              },
            ],
          },
          {
            id: uuid(),
            name: 'platinumCardiOS',
            displayName: 'Platinum Card',
            price: 2000,
            includes: [
              {
                id: uuid(),
                title: 'Настройка медиа-сервисов',
                description:
                  'Настраиваем подписки на сервисы AppleMusic, Spotify, Netflix, YouTube т.д.',
              },
              {
                id: uuid(),
                title: 'Синхронизация всех устройств',
                description:
                  'Данные клиента всегда будут доступны на любом из его устройств',
              },
              {
                id: uuid(),
                title: 'Резервное копирование',
                description:
                  'Автоматические резервные копии данных в облако, для сохранности в случае утери, или поломки телефона',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 3мес',
              },
            ],
          },
        ],
      },

      {
        id: uuid(),
        name: 'windows',
        displayName: 'MacOS',
        items: [
          {
            id: uuid(),
            name: 'silverCardMacOS',
            displayName: 'Sivler Card',
            price: 2000,
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи AppleID',
                description:
                  'Активация синхронизации с iCloud. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого Mac, или Windows. Перенос осуществляется с ОДНОГО старого устройства.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'Настройка офисных программ',
                description:
                  'Установка Docs, Sheets, Presentation, Adobe Acrobat. Все "вордовские", "екселевские" и т.д. файы будет открываться автоматически в нужной программе. Без них даже обычный "вордовский" документ не откроется.',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
            ],
          },
          {
            id: uuid(),
            name: 'goldCardMacOS',
            displayName: 'Gold Card',
            price: 5000,
            includes: [
              {
                id: uuid(),
                title: 'Подбор лучших приложений',
                description:
                  'Клиент называет функцию, например "хочу редактирофать фотки" - тех ставит 3-4 топовых фоторедактора.',
              },
              {
                id: uuid(),
                title: 'Електронная коммерция',
                description:
                  'Настройка GooglePay, банкингов и других платежных систем',
              },
              {
                id: uuid(),
                title: 'Оптимизация ОС',
                description:
                  'Настройка энергопотребления, отключение ненужных фоновых процессов, настройка автоочистки кэша, настройка потребления трафика и т.д.',
              },
              {
                id: uuid(),
                title: 'CleanMyMac 12мес',
                description: 'Программа для очистки и оптимизации MacOS',
              },
              {
                id: uuid(),
                title: 'MS Office 365',
                description: 'Подписка на лицензионный офис на 1 год',
              },
            ],
          },
          {
            id: uuid(),
            name: 'platinumCardMacOS',
            displayName: 'Platinum Card',
            price: 10000,
            includes: [
              {
                id: uuid(),
                title: 'Настройка медиа-сервисов',
                description:
                  'Настраиваем подписки на сервисы AppleMusic, Spotify, Netflix, YouTube т.д.',
              },
              {
                id: uuid(),
                title: 'Синхронизация всех устройств',
                description:
                  'Данные клиента всегда будут доступны на любом из его устройств',
              },
              {
                id: uuid(),
                title: 'Резервное копирование',
                description:
                  'Автоматические резервные копии данных в облако, для сохранности в случае утери, или поломки телефона',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 3мес',
              },
              {
                id: uuid(),
                title: 'Windows 10',
                description:
                  'Лицензия ОС Windows НЕ ВКЛЮЧАЕТ ЛИЦЕНЗИЮ ParallelsDesktop!! При продаже на М1 - ОБЯЗАТЕЛЬНО добавлять паралель, иначе Windows не установится',
              },
            ],
          },
        ],
      },
      {
        id: uuid(),
        name: 'windows',
        displayName: 'Windows',
        items: [
          {
            id: uuid(),
            name: 'silverCardWindows',
            displayName: 'Sivler Card',
            price: 2000,
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи Microsoft',
                description:
                  'Активация синхронизации с OneDrive. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Установка ОС',
                description:
                  'Установка бесплатной ОС (linux, ubuntu т.д.), или Windows ПРИ НАЛИЧИИ ЛИЦЕНЗИИ',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого Mac, или Windows. Перенос осуществляется с ОДНОГО старого устройства.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'Настройка офисных программ',
                description:
                  'Установка Docs, Sheets, Presentation, Adobe Acrobat. Все "вордовские", "екселевские" и т.д. файы будет открываться автоматически в нужной программе. Без них даже обычный "вордовский" документ не откроется.',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Антивирус',
                description: 'Лицензионный антивирус AdLock 12мес.',
              },
            ],
          },
          {
            id: uuid(),
            name: 'goldCardWindows',
            displayName: 'Gold Card',
            price: 7000,
            includes: [
              {
                id: uuid(),
                title: 'Подбор лучших приложений',
                description:
                  'Клиент называет функцию, например "хочу редактирофать фотки" - тех ставит 3-4 топовых фоторедактора.',
              },
              {
                id: uuid(),
                title: 'Електронная коммерция',
                description:
                  'Настройка GooglePay, банкингов и других платежных систем',
              },
              {
                id: uuid(),
                title: 'Оптимизация ОС',
                description:
                  'Настройка энергопотребления, отключение ненужных фоновых процессов, настройка автоочистки кэша, настройка потребления трафика и т.д.',
              },
              {
                id: uuid(),
                title: 'ОС Windows 10 Home',
                description: 'Лицензионный ключе ОС Windows',
              },
            ],
          },
          {
            id: uuid(),
            name: 'platinumCardWindows',
            displayName: 'Platinum Card',
            price: 9000,
            includes: [
              {
                id: uuid(),
                title: 'Настройка медиа-сервисов',
                description:
                  'Настраиваем подписки на сервисы AppleMusic, Spotify, Netflix, YouTube т.д.',
              },
              {
                id: uuid(),
                title: 'Синхронизация всех устройств',
                description:
                  'Данные клиента всегда будут доступны на любом из его устройств',
              },
              {
                id: uuid(),
                title: 'Резервное копирование',
                description:
                  'Автоматические резервные копии данных в облако, для сохранности в случае утери, или поломки телефона',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
              {
                id: uuid(),
                title: 'Megogo IPTV',
                description: 'Подписка на Megogo Смартфон 3мес',
              },
              {
                id: uuid(),
                title: 'MS Office 365',
                description: 'Подписка на лицензионный офис на 1 год',
              },
            ],
          },
        ],
      },
    ],
  },
  {
    id: uuid(),
    title: 'Разовые Пакеты',
    os: [
      {
        id: uuid(),
        name: 'androidSmartCard',
        displayName: 'AndroidSmartCard',
        items: [
          {
            id: uuid(),
            name: '',
            price: 600,
            displayName: '',
            includes: [
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО до последней версии',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи Google',
                description:
                  'Активация синхронизации с Google. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого телефона. Перенос осуществляется с ОДНОГО старого телефона. Максимальный обьем переноса - 20гб, все что больше оплачивается отдельно',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'Настройка офисных программ',
                description:
                  'Установка Docs, Sheets, Presentation, Adobe Acrobat. Все "вордовские", "екселевские" и т.д. файы будет открываться автоматически в нужной программе. Без них даже обычный "вордовский" документ не откроется.',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
              {
                id: uuid(),
                title: 'Антивирус',
                description: 'Лицензионный антивирус AVAST 12мес.',
              },
            ],
          },
        ],
      },
      {
        id: uuid(),
        name: 'multisoft',
        displayName: 'Multisoft',
        items: [
          {
            id: uuid(),
            name: '',
            price: 800,
            displayName: '',
            includes: [
              {
                id: uuid(),
                title: 'IPTV',
                description: 'Подписка на SweetTV 3мес',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
              {
                id: uuid(),
                title: 'Антивирус',
                description: 'Лицензионный антивирус AVAST 12мес.',
              },
            ],
          },
        ],
      },
      {
        id: uuid(),
        name: 'officeBundle',
        displayName: 'Office Bundle',
        items: [
          {
            id: uuid(),
            name: 'BundleHomeStudent',
            price: 6000,
            displayName: 'Bundle Home & Student',
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Активация синхронизации. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Установка ОС',
                description: 'Установка бесплатной ОС (При наличии лицензии)',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого Mac, или Windows. Перенос осуществляется с ОДНОГО старого устройства.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'MS Office Home & Student',
                description: 'Лицензионный ключ на MS Office Home & Student',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock 12мес.',
              },
            ],
          },
          {
            id: uuid(),
            name: 'Bundle365Desktop',
            price: 4200,
            displayName: 'Bundle 365 Desktop',
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Активация синхронизации. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Установка ОС',
                description: 'Установка бесплатной ОС (При наличии лицензии)',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого Mac, или Windows. Перенос осуществляется с ОДНОГО старого устройства.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'MS Office 365',
                description: 'Лицензионный ключ на MS Office 365',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description:
                  'Лицензионный антибанер AdLock Windows/MacOS 12мес.',
              },
            ],
          },

          {
            id: uuid(),
            name: 'Bundle365Mobile',
            price: 4200,
            displayName: 'Bundle 365 Mobile',
            includes: [
              {
                id: uuid(),
                title: 'Тех. поддержка',
                description:
                  'Прошивка, обновления, исправление системных сбоев, настройка приложений на протяжении 12 месяцев. Поддержка оказывается в магазине, или на горячей линии по номеру 044-503-70-30',
              },
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Активация синхронизации. Восстановление старой учетной записи если это возможно',
              },
              {
                id: uuid(),
                title: 'Установка ОС',
                description: 'Установка бесплатной ОС (При наличии лицензии)',
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description:
                  'Перенос информации со старого Mac, или Windows. Перенос осуществляется с ОДНОГО старого устройства.',
              },
              {
                id: uuid(),
                title: 'Настройка браузеров',
                description:
                  'Установка Chrome, Firefox, Opera и т.д. Синхронизация закладок и истории с учетной записью Google',
              },
              {
                id: uuid(),
                title: 'Настройка аудео и видео плееров',
                description:
                  'Установка всех существующих форматов и кодеков аудио/видео, без которых большенство медиа-контента не будет воспроизводиться',
              },
              {
                id: uuid(),
                title: 'MS Office 365',
                description: 'Лицензионный ключ на MS Office 365',
              },
              {
                id: uuid(),
                title: 'Файловые менеджеры',
                description:
                  'Установка архиватоа и альтернативных файовых менеджеров',
              },
              {
                id: uuid(),
                title: 'Блокировщик рекламы',
                description: 'Лицензионный антибанер AdLock Mobile 12мес.',
              },
            ],
          },
        ],
      },
      {
        id: uuid(),
        name: 'tv',
        displayName: 'TV',
        items: [
          {
            id: uuid(),
            name: 'packageSweetTV',
            price: 800,
            displayName: 'Пакет TV SweetTV',
            includes: [
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО до последней версии',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Создание и подключение учетной записи Samsung/LG/Google т.д. для доступа в магазин приложений и фирменым сервисам',
              },
              {
                id: uuid(),
                title: 'SweetTV 3мес',
                description: 'Лицензия SweetTV 3мес (тариф - L)',
              },
            ],
          },
          {
            id: uuid(),
            name: 'packageOllTV',
            price: 900,
            displayName: 'Пакет TV OllTV',
            includes: [
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО до последней версии',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Создание и подключение учетной записи Samsung/LG/Google т.д. для доступа в магазин приложений и фирменым сервисам',
              },
              {
                id: uuid(),
                title: 'OllTV 3мес',
                description: 'Лицензия OllTV 3мес (тариф - Футбол+Кинозалы)',
              },
            ],
          },
          {
            id: uuid(),
            name: 'packageMegogoTV',
            price: 800,
            displayName: 'Пакет TV Megogo',
            includes: [
              {
                id: uuid(),
                title: 'Первоначальная настройка',
                description:
                  'Активация, настройка языка, даты, времени, интернета',
              },
              {
                id: uuid(),
                title: 'Обновление ПО до последней версии',
                description:
                  'Обновление систем безопасности, добавление новых функций',
              },
              {
                id: uuid(),
                title: 'Настройка Учетной записи',
                description:
                  'Создание и подключение учетной записи Samsung/LG/Google т.д. для доступа в магазин приложений и фирменым сервисам',
              },
              {
                id: uuid(),
                title: 'Megogo 3мес',
                description: 'Лицензия Megogo 3мес (тариф - Стартовый)',
              },
            ],
          },
        ],
      },
    ],
  },
  {
    id: uuid(),
    title: 'Разовые Услуги',
    os: [
      {
        id: uuid(),
        name: 'all',
        displayName: 'Все разовые',
        items: [
          {
            id: uuid(),
            name: '',
            displayName: '',
            includes: [
              {
                id: uuid(),
                title: 'Адаптация SIM карты/Поклейка пленки',
                description: '',
                price: 49,
              },
              {
                id: uuid(),
                title: 'Восстановление после системного сбоя Android',
                description: 'По согласованию теха',
                price: 300,
              },
              {
                id: uuid(),
                title: 'Восстановление после системного сбоя Apple',
                description: 'По согласованию теха',
                price: 600,
              },
              {
                id: uuid(),
                title: 'Консультация технического эксперта',
                description: '',
                price: 100,
              },
              {
                id: uuid(),
                title: 'Легкий Старт',
                description: 'Поклейка, обрезка, перенос контактов',
                price: 300,
              },
              {
                id: uuid(),
                title: 'Миграция данных',
                description: 'С ОДНОГО устройства ДО 32гб',
                price: 600,
              },
              {
                id: uuid(),
                title: 'Миграция фото/видео до 10 ГБ',
                description: 'С ОДНОГО устройства ДО 10гб',
                price: 300,
              },
              {
                id: uuid(),
                title: 'Настройка Mac (ОС, Приложения, Учетные записи)',
                description: 'Прошивка МАС без сохранения данных',
                price: 800,
              },
              {
                id: uuid(),
                title: 'Настройка Smart Watch',
                description: '',
                price: 500,
              },
              {
                id: uuid(),
                title: 'Настройка Smart TV на ТТ',
                description: '',
                price: 500,
              },
              {
                id: uuid(),
                title: 'Настройка игровой консоли (PlayStation/XBOX)',
                description: '',
                price: 500,
              },
              {
                id: uuid(),
                title: 'Настройка облачного хранилища',
                description: '',
                price: 150,
              },
              {
                id: uuid(),
                title: 'Настройка ОС Windows',
                description: 'Установка Windows ПРИ НАЛИЧИИ ЛИЕНЗИИ',
                price: 500,
              },
              {
                id: uuid(),
                title: 'Настройка офисных приложений на ПК',
                description: '',
                price: 200,
              },
              {
                id: uuid(),
                title: 'Обновление ПО (Смартфон, Планшет, ПК)',
                description: 'Без сохранения данных',
                price: 300,
              },
              {
                id: uuid(),
                title: 'Обновление ПО с сохранением клиентских данных',
                description: 'Данные сохраняются (если возможно)',
                price: 600,
              },
              {
                id: uuid(),
                title: 'Перенос контактов',
                description: 'С ОДНОГО телефона',
                price: 200,
              },
              {
                id: uuid(),
                title: 'Создание и настройка AppleID',
                description: '',
                price: 200,
              },
              {
                id: uuid(),
                title: 'Чистка памяти на устройстве',
                description: 'По согласованию теха',
                price: 200,
              },
            ],
          },
        ],
      },
    ],
  },
];
